# St7RebuildFaces

Redefines the parametric space of NURBS geometry faces to improve mesh quality using parameters determined
by Strand7.

long St7RebuildFaces(long uID)
Input Parameters
uID
Strand7 model file ID.
Dependencies
Selection
Entities can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.
Global Parameters
ivFacesChanged, ivFacesFailed.